app/controllers/auth_controller.rb

SELECT "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "ana"], ["LIMIT", 1]]
---
    def create
        @user = User.find_by(username: login_params[:username])