app/controllers/bets_controller.rb

    def index
      bets = Bet.all
---
SELECT "bets".* FROM "bets"