app/controllers/rounds_controller.rb

SELECT "locations".* FROM "locations"
SELECT "rounds".* FROM "rounds"
---
    def index
        locations = Location.all
        locations.each do |loc|
            Round.manage_rounds(loc)
        end
        Round.close_open_rounds
        rounds = Round.all