app/models/round.rb

    def self.manage_rounds(location)
        uri = URI.parse(location.forecast_url)
        response = Net::HTTP.get_response(uri)
        forecast = JSON.parse(response.body)
        forecast["properties"]["periods"].each do |forecast|
            self.create(location_id: location.id, is_open: true, finish_time: DateTime.parse(forecast["endTime"]))
---
INSERT INTO "rounds" ("location_id", "is_open", "finish_time", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["location_id", 1], ["is_open", true], ["finish_time", "2019-10-21 23:00:00"], ["created_at", "2019-10-21 20:09:56.460342"], ["updated_at", "2019-10-21 20:09:56.460342"]]

    def self.close_open_rounds
        self.all.each do |round|
            if Time.now > round.finish_time
                round.update(is_open: false)
---
SELECT "rounds".* FROM "rounds"
UPDATE "rounds" SET "is_open" = $1, "updated_at" = $2 WHERE "rounds"."id" = $3  [["is_open", false], ["updated_at", "2019-10-21 20:09:03.931084"], ["id", 43]]